analogdevicesinc/msdk/Examples/MAX32572/MAX32572_Demo_FreeRTOS/src/task_keypad.c
/******************************************************************************
 *
 * Copyright (C) 2022-2023 Maxim Integrated Products, Inc., All Rights Reserved.
 * (now owned by Analog Devices, Inc.)
 *
 * Permission is hereby granted, free of charge, to any person obtaining a
 * copy of this software and associated documentation files (the "Software"),
 * to deal in the Software without restriction, including without limitation
 * the rights to use, copy, modify, merge, publish, distribute, sublicense,
 * and/or sell copies of the Software, and to permit persons to whom the
 * Software is furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included
 * in all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS
 * OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
 * IN NO EVENT SHALL MAXIM INTEGRATED BE LIABLE FOR ANY CLAIM, DAMAGES
 * OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR
 * OTHER DEALINGS IN THE SOFTWARE.
 *
 * Except as contained in this notice, the name of Maxim Integrated
 * Products, Inc. shall not be used except as stated in the Maxim Integrated
 * Products, Inc. Branding Policy.
 *
 * The mere transfer of this software does not imply any licenses
 * of trade secrets, proprietary technology, copyrights, patents,
 * trademarks, maskwork rights, or any other form of intellectual
 * property whatsoever. Maxim Integrated Products, Inc. retains all
 * ownership rights.
 *
 ******************************************************************************
 *
 * Copyright 2023 Analog Devices, Inc.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 ******************************************************************************/

#include <string.h>
#include <stdint.h>

#include <FreeRTOS.h>
#include <task.h>
#include <queue.h>
#include <semphr.h>

#include "MAX32xxx.h"
#include "keypad.h"
#include "message.h"

static unsigned int is_key_pressed;
extern xQueueHandle xQueueMain;
static xSemaphoreHandle xKBDLock;

/* keys mapping on the keyboard */
static unsigned char keyboard_map[16] = { KEY_F, KEY_E, KEY_D, KEY_C, KEY_3, KEY_6, KEY_9, KEY_B,
                                          KEY_2, KEY_5, KEY_8, KEY_0, KEY_1, KEY_4, KEY_7, KEY_A };

void keypad_stop(void)
{
    MXC_SKBD_DisableInterruptEvents(MXC_SKBD_INTERRUPT_STATUS_PUSHIS |
                                    MXC_SKBD_INTERRUPT_STATUS_OVERIS);
}

void keypad_start(void)
{
    MXC_SKBD_EnableInterruptEvents(MXC_SKBD_INTERRUPT_STATUS_PUSHIS |
                                   MXC_SKBD_INTERRUPT_STATUS_OVERIS);
}

void keypad_handler(void)
{
    unsigned int status;

    MXC_SKBD_InterruptStatus(&status);

    if (MXC_F_SKBD_ISR_OVERIS & status) {
        MXC_SKBD_ClearInterruptStatus(MXC_F_SKBD_ISR_OVERIS);
    }
    if (MXC_F_SKBD_ISR_PUSHIS & status) {
        is_key_pressed = 1;
        /* Clear interruption */
        MXC_SKBD_ClearInterruptStatus(MXC_F_SKBD_ISR_PUSHIS);
    }
    if (MXC_F_SKBD_ISR_RELEASEIS & status) {
        MXC_SKBD_ClearInterruptStatus(MXC_F_SKBD_ISR_RELEASEIS);
    }
    xSemaphoreGiveFromISR(xKBDLock, NULL);

    return;
}

int keypad_init(void)
{
    int rv = 0;
    mxc_skbd_config_t skb_cfg;

    skb_cfg.inputs = MXC_SKBD_KBDIO4 | MXC_SKBD_KBDIO5 | MXC_SKBD_KBDIO6 | MXC_SKBD_KBDIO7;
    skb_cfg.outputs = MXC_SKBD_KBDIO0 | MXC_SKBD_KBDIO1 | MXC_SKBD_KBDIO2 | MXC_SKBD_KBDIO3;
    skb_cfg.debounce = MXC_V_SKBD_CR1_DBTM_TIME10MS;
    skb_cfg.ioselect = 0;
    skb_cfg.irq_handler = (irq_handler_t)keypad_handler;
    skb_cfg.reg_erase = 1;

    MXC_SKBD_PreInit();

    rv = MXC_SKBD_Init(skb_cfg);
    if (rv) {
        return E_UNINITIALIZED;
    }

    keypad_start();

    return 0;
}

void vGetKEYTask(void *pvParameters)
{
    (void)pvParameters;

    uint16_t *key;
    mxc_skbd_keys_t keys = { 0, 0, 0, 0 };
    volatile unsigned int in;
    volatile unsigned int out;
    volatile unsigned int i;
    char key_press[5];
    char *key_ptr = key_press;
    message_t msgKBD;

    keypad_init();

    xKBDLock = xSemaphoreCreateBinary();

    msgKBD.pcType = 'K'; // it is keyboard message

    for (;;) {
        while (xSemaphoreTake(xKBDLock, 0xFFFF) != pdTRUE) {
            {
            }
        }

        key_press[0] = '\0';

        if (is_key_pressed) {
            MXC_SKBD_ReadKeys(&keys);
            key = &keys.key0;
            for (i = 0; i < 4; i++) {
                in = 0x0f & *key;
                out = (0xf0 & *key) >> 4;

                if (*key) {
                    *key_ptr = keyboard_map[(in - 4) * 4 + out];
                    key_press[i] = *key_ptr;
                    key_press[i + 1] = '\0';
                }
                *key = 0;
                key++;
            }
            /* Clear interruption */
            MXC_SKBD_ClearInterruptStatus(MXC_SKBD_INTERRUPT_STATUS_PUSHIS);

            // Send Key
            msgKBD.pcMessage[0] = key_press[0];
            xQueueSendToFrontFromISR(xQueueMain, &msgKBD, NULL);
        }
    }
}
